# Table of contents

#### 1- Importing dataframe/ libraries¶
#### 2- Data wrangling:
                  01 Renaming columns
                  02 Changing data types
#### 3- Data quality and consistency check: 01 Locating and addressing mixed columns¶
                                       02 Locating and addressing missing entries
                                       03 Locating and addressing duplicates
                  
#### 4- Exporting dataframe

## 1 Importing dataframe/libraries

In [5]:
#importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [6]:
#importing dataframe
path=r'/Users/Amaikuru/Desktop/08-06-2022 Instacart Basket Analysis.nosync'

In [7]:
df=pd.read_csv(os.path.join(path, '02 Data', 'Original', 'customers.csv'))

## 2 Data wrangling

In [8]:
df

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

### 01 Renaming columns

In [9]:
#renaming the first name column first_name
df.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
# rename the surnam column last_name
df.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [11]:
#renaming n_dependants column no_of_dependents
df.rename(columns = {'n_dependants' : 'no_of_dependents'}, inplace = True)

In [12]:
# renaming fam_status column marital_status
df.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [13]:
#renaming Gender column gender
df.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [14]:
#renaming Age column age
df.rename(columns = {'Age' : 'age'}, inplace = True)

In [15]:
#renaming STATE column state
df.rename(columns = {'STATE' : 'state'}, inplace = True)

In [16]:
df.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 02 Changing data types

In [17]:
#looking through data types
df.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependents     int64
marital_status      object
income               int64
dtype: object

#### the data types are fine

## 3 Data quality and consistency check

### 01 Locating and addressing mixed columns

In [18]:
#looking  for mixed data types
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

first_name

#### The first_name column has mixed data types

In [19]:
#changing all first_name entries to string
df['first_name'] = df['first_name'].astype('str')

In [20]:
#re-checking 
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

#### There is no longer any mixed column

###  02 Locating and addressing missing entries

In [21]:
#counting the missing values in each column
df.isnull().sum()

user_id             0
first_name          0
last_name           0
gender              0
state               0
age                 0
date_joined         0
no_of_dependents    0
marital_status      0
income              0
dtype: int64

#### There are no missing entries

### 03 Locating and addressing duplicates

In [22]:
#looking for full duplicates
df_dups = df[df.duplicated()]

#### There are no duplicates

In [23]:
#importing latest merged data
df_big=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared', 'orders_products_merged_grouped.pkl'))

In [24]:
#checking datatypes for merging
df_big.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_periods             object
max_order                    int64
loyalty_flag                object
mean_price                 float64
spending_flag               object
median_prior_days          float64
order_frequency             object
dtype: object

In [25]:
#merging on user_id columnn
df_merged=df.merge(df_big, on = 'user_id', how = 'inner')

In [26]:
df_merged.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependents,marital_status,income,...,price_range_loc,busiest_day,busiest_days,busiest_periods,max_order,loyalty_flag,mean_price,spending_flag,median_prior_days,order_frequency
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Low-range product,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Low-range product,Regularly busy,Least busy days,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular customer

In [28]:
df_merged.shape

(32404859, 33)

## 4 Exporting dataframe

In [29]:
#exporting dataframe
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared', 'final_merge.pkl'))